Hom-Wang/NRF5x/NRF51_TestLED/Libraries/src/app_common/pstorage.c
/**@} */

/**
 * @brief Application registration information.
 *
 * @details Define application specific information that application needs to maintain to be able
 *          to process requests from each one of them.
 */
typedef struct ps_module_table
{
    pstorage_ntf_cb_t      cb;             /**< Callback registered with the module to be notified of result of flash access.  */
    pstorage_block_t       base_id;        /**< Base block id assigned to the module */
    uint32_t               block_size;     /**< Size of block for the module */
    uint16_t               block_count;    /**< Number of block requested by application */
    uint16_t               no_of_pages;    /**< Variable to remember how many pages have been allocated for this module. This information is used for clearing of block, so that application does not need to have knowledge of number of pages its using. */
}pstorage_module_table_t;

#ifdef PSTORAGE_RAW_MODE_ENABLE
/**
 * @brief Application registration information.
 *
 * @details Define application specific information that application registered for raw mode.
 */
typedef struct ps_raw_module_table
{
    pstorage_ntf_cb_t      cb;             /**< Callback registered with the module to be notified of result of flash access.  */
    uint16_t               no_of_pages;    /**< Variable to remember how many pages have been allocated for this module. This information is used for clearing of block, so that application does not need to have knowledge of number of pages its using. */
}pstorage_raw_module_table_t;
#endif // PSTORAGE_RAW_MODE_ENABLE


//
// Utility functions needed for interfacing with flash through SoC APIs.
// SoC APIs are non blocking and provide the result of flash access through an event.
// Plus, only one flash access operation is permitted at a time. Current design of most SDK modules
// assumes a blocking interface for the flash. In order to ensure no APIs of bond manager are
// altered this interface, queues any flash access if need be for bond manager and notifies the
// bond manager in case of any failure. In case there are no failure, bond manager can assume the
// operation succeeded. It should also be noted that in order to avoid copy of data, and achieve
// optimizations in flash access, only the latest changes written to flash. Therefore, if the
// contents of pointed by the source address changes, the changed content will be written to flash.
// Queued access operations will be scheduled in FIFO order.
//
//

/**
 * @brief Defines command queue element.
 *
 * @details Defines command queue element. Each element encapsulates needed information to process
 *          a flash access command.
 */
typedef struct cmd_element
{
    uint8_t              op_code;          /**< Identifies flash access operation being queued. Element is free is op-code is INVALID_OPCODE */
    uint32_t             size;             /**< Identifies size in bytes requested for the operation. */
    pstorage_handle_t    storage_addr;     /**< Address/Identifier for persistent memory. */
    uint8_t              * p_data_addr;    /**< Address/Identifier for data memory. This is assumed to be resident memory. */
    uint32_t             offset;           /**< Offset requested by the application for access operation. */
    uint32_t             round_val;        /**< Round value for multiple round operations. For erase operations, the round value will contain current round counter which is identical to number of pages erased. For store operations, the round value contains current round of operation * SOC_MAX_WRITE_SIZE to ensure each store to the SoC Flash API is within the SoC limit. */
}cmd_queue_element_t;


/**
 * @brief Defines command queue, an element is free is op_code field is not invalid.
 *
 * @details Defines commands enqueued for flash access. At any point of time, this queue has one or
 *          more flash access operation pending if the count field is not zero. When the queue is
 *          not empty, the rp (read pointer) field points to the flash access in progress or to
 *          requested next. The queue implements a simple first in first out algorithm.
 *          Data addresses are assumed to be resident.
 */
typedef struct queue
{
    uint8_t              rp;                     /**< Read pointer, pointing to flash access that is ongoing or to be requested next. */
    uint8_t              count;                  /**< Number of elements in the queue.  */
    bool                 flash_access;           /**< Flag to ensure an flash event received is for an request issued by the module. */
    cmd_queue_element_t  cmd[CMD_QUEUE_SIZE];    /**< Array where flash access operation details are maintained */

}cmd_queue_t;

static cmd_queue_t             m_cmd_queue;                               /**< Flash operation request queue. */
static pstorage_module_table_t m_app_table[PSTORAGE_MAX_APPLICATIONS];    /**< Registered application information table. */

#ifdef PSTORAGE_RAW_MODE_ENABLE
static pstorage_raw_module_table_t m_raw_app_table; /**< Registered application information table for raw mode. */
#endif // PSTORAGE_RAW_MODE_ENABLE

static uint32_t m_next_app_instance;                                      /**< Points to the application module instance that can be allocated next */
static uint32_t m_next_page_addr;                                         /**< Points to the flash address that can be allocated to a module next, this is needed as blocks of a module can span across flash pages. */
static bool     m_module_initialized = false;                             /**< Flag for checking if module has been initialized. */

static uint32_t process_cmd(void);
static void app_notify (uint32_t reason);

//Initializes command queue element.
static void cmd_queue_init_element(uint32_t index)
{
    // Internal function and checks on range of index can be avoided
    m_cmd_queue.cmd[index].op_code                = INVALID_OPCODE;
    m_cmd_queue.cmd[index].size                   = 0;
    m_cmd_queue.cmd[index].storage_addr.module_id = PSTORAGE_MAX_APPLICATIONS;
    m_cmd_queue.cmd[index].storage_addr.block_id  = 0;
    m_cmd_queue.cmd[index].p_data_addr            = NULL;
    m_cmd_queue.cmd[index].offset                 = 0;
    m_cmd_queue.cmd[index].round_val              = 0;
}


// Initializes command queue.
static void cmd_queue_init (void)
{
    uint32_t cmd_index;

    m_cmd_queue.rp = 0;
    m_cmd_queue.count = 0;
    m_cmd_queue.flash_access = false;

    for(cmd_index = 0; cmd_index < CMD_QUEUE_SIZE; cmd_index++)
    {
        cmd_queue_init_element(cmd_index);
    }
}


// Routine to enqueue a flash access operation.
static uint32_t cmd_queue_enqueue(uint8_t opcode, pstorage_handle_t * p_storage_addr,uint8_t * p_data_addr, uint32_t size, uint32_t offset)
{
    uint32_t retval;
    uint8_t  write_index = 0;


    // If no flash access operation is ongoing, schedule the operation now!
    // Else, needs to be enqueued.
    //    For Store/Write Operation, is something is already enqueued for same source,
    //    destination address, do nothing, wait for the queued write to be executed.
    //
    //    For Erase, any queued write operations in the range of dest address to dest address+size need not
    //    to be executed, hence flush them out as  information is going to be erased in any case.
    retval = NRF_ERROR_NO_MEM;

    if ((m_cmd_queue.flash_access == false) && (m_cmd_queue.count == 0))
    {
        m_cmd_queue.rp = 0;
        m_cmd_queue.cmd[m_cmd_queue.rp].op_code      = opcode;
        m_cmd_queue.cmd[m_cmd_queue.rp].p_data_addr  = p_data_addr;
        m_cmd_queue.cmd[m_cmd_queue.rp].storage_addr = (*p_storage_addr);
        m_cmd_queue.cmd[m_cmd_queue.rp].size         = size;
        m_cmd_queue.cmd[m_cmd_queue.rp].offset       = offset;
        m_cmd_queue.cmd[m_cmd_queue.rp].round_val    = 0;
        m_cmd_queue.count++;
        retval = process_cmd();
        if ((retval == NRF_SUCCESS) || (retval == NRF_ERROR_BUSY))
        {
            // In case of busy error code, it is possible to attempt to access flash
            retval = NRF_SUCCESS;
        }
    }
    else if (CMD_QUEUE_SIZE != m_cmd_queue.count)
    {
        // TODO: Added intelligence to not enqueue write commands with same source and
        // destination, or in case a clear is issued in an block range, remove all requested
        // writes

        // Enqueue the command if it is queue is not full
        write_index = m_cmd_queue.rp + m_cmd_queue.count;

        if (write_index >= CMD_QUEUE_SIZE)
        {
            write_index -= CMD_QUEUE_SIZE;
        }

