Hom-Wang/NRF5x/NRF51_TestLED/Libraries/src/app_common/pstorage.c
        m_cmd_queue.cmd[write_index].op_code      = opcode;
        m_cmd_queue.cmd[write_index].p_data_addr  = p_data_addr;
        m_cmd_queue.cmd[write_index].storage_addr = (*p_storage_addr);
        m_cmd_queue.cmd[write_index].size         = size;
        m_cmd_queue.cmd[write_index].offset       = offset;
        m_cmd_queue.cmd[write_index].round_val    = 0;
        m_cmd_queue.count++;

        retval = NRF_SUCCESS;

    }

    return retval;
}


// Dequeues a command element.
static uint32_t cmd_queue_dequeue(void)
{
    uint32_t retval;    

    cmd_queue_element_t * p_cmd = &m_cmd_queue.cmd[m_cmd_queue.rp];
    // Update count and read pointer to process any queued requests
    if(p_cmd->round_val >= p_cmd->size)
    {
        // Initialize/free the element as it is now processed.
        cmd_queue_init_element(m_cmd_queue.rp);

        m_cmd_queue.count--;
        m_cmd_queue.rp++;
    }

    retval = NRF_SUCCESS;

    // If any flash operation is enqueued, schedule
    if (m_cmd_queue.count)
    {
        retval = process_cmd();

        if (retval != NRF_SUCCESS)
        {
            // Flash could be accessed by modules other than Bond Manager, hence a busy error is
            // acceptable, but any other error needs to be indicated to the bond manager
            if (retval != NRF_ERROR_BUSY)
            {
                app_notify (retval);
            }
            else
            {
                // In case of busy next trigger will be a success or a failure event
            }
        }
    }
    else
    {
        // No flash access request pending
    }

    return retval;
}


// Routine to notify application of any errors.
static void app_notify (uint32_t result)
{
    pstorage_ntf_cb_t  ntf_cb;
    uint8_t            op_code = m_cmd_queue.cmd[m_cmd_queue.rp].op_code;
    
#ifdef PSTORAGE_RAW_MODE_ENABLE
    if(m_cmd_queue.cmd[m_cmd_queue.rp].storage_addr.module_id == (PSTORAGE_MAX_APPLICATIONS + 1))
    {
        ntf_cb = m_raw_app_table.cb;
    }
    else
#endif // PSTORAGE_RAW_MODE_ENABLE
    {
        ntf_cb = m_app_table[m_cmd_queue.cmd[m_cmd_queue.rp].storage_addr.module_id].cb;
    }

    // Indicate result to client.
    // For PSTORAGE_CLEAR_OP_CODE no size is returned as the size field is used only internally 
    // for clients registering multiple pages.
    ntf_cb(&m_cmd_queue.cmd[m_cmd_queue.rp].storage_addr,
           op_code,
           result,
           m_cmd_queue.cmd[m_cmd_queue.rp].p_data_addr,
           op_code == PSTORAGE_CLEAR_OP_CODE ? 0 : m_cmd_queue.cmd[m_cmd_queue.rp].size);
}


// Handles Flash Access Result Events.
void pstorage_sys_event_handler (uint32_t sys_evt)
{
    uint32_t retval;

    retval = NRF_SUCCESS;

    // Its possible the flash access was not initiated by bond manager, hence
    // event is processed only if the event triggered was for an operation requested by the
    // bond manager.
    if (m_cmd_queue.flash_access == true)
    {
        cmd_queue_element_t * p_cmd;
        m_cmd_queue.flash_access = false;
        switch (sys_evt)
        {
            case NRF_EVT_FLASH_OPERATION_SUCCESS:
                p_cmd = &m_cmd_queue.cmd[m_cmd_queue.rp];
                if ((p_cmd->op_code != PSTORAGE_CLEAR_OP_CODE) || (p_cmd->round_val >= p_cmd->size))
                {
                    app_notify(retval);
                }
                // Schedule any queued flash access operations
                retval = cmd_queue_dequeue ();
                if (retval != NRF_SUCCESS)
                {
                    app_notify(retval);
                }

                break;
            case NRF_EVT_FLASH_OPERATION_ERROR:
                app_notify(NRF_ERROR_TIMEOUT);
                break;
            default:
                // No implementation needed.
                break;
        }
    }
}


// Routine called to actually issue the flash access request to the SoftDevice.
static uint32_t process_cmd(void)
{
    uint32_t             retval;
    uint32_t             storage_addr;
    cmd_queue_element_t * p_cmd;

    retval = NRF_ERROR_FORBIDDEN;

    p_cmd = &m_cmd_queue.cmd[m_cmd_queue.rp];

    storage_addr = p_cmd->storage_addr.block_id;

    if (p_cmd->op_code == PSTORAGE_CLEAR_OP_CODE)
    {
        // Calculate page number before copy.
        uint32_t page_number;

        page_number =  ((storage_addr / PSTORAGE_FLASH_PAGE_SIZE) +
                        p_cmd->round_val);

        retval = sd_flash_page_erase(page_number);

        if (NRF_SUCCESS == retval)
        {
            p_cmd->round_val++;
        }
    }
    else if (p_cmd->op_code == PSTORAGE_STORE_OP_CODE)
    {
        uint32_t size;
        uint8_t * p_data_addr = p_cmd->p_data_addr;
    
        p_data_addr += p_cmd->round_val;
        
        storage_addr += (p_cmd->offset + p_cmd->round_val);
        
        size = p_cmd->size - p_cmd->round_val;
        
        if (size < SOC_MAX_WRITE_SIZE)
        {
            retval = sd_flash_write(((uint32_t *)storage_addr),
                                     (uint32_t *)p_data_addr,
                                     size / sizeof(uint32_t));
        }
        else
        {
            retval = sd_flash_write(((uint32_t *)storage_addr),
                                     (uint32_t *)p_data_addr,
                                     SOC_MAX_WRITE_SIZE / sizeof(uint32_t));
        }
        

        if (retval == NRF_SUCCESS)
        {
            p_cmd->round_val += SOC_MAX_WRITE_SIZE;
        }
    }
    else
    {
        // Should never reach here.
    }
    
    if (retval == NRF_SUCCESS)
    {
       m_cmd_queue.flash_access = true;
    }

    return retval;
}


// Module initialization routine to be called once by the application.
uint32_t pstorage_init(void)
{
    cmd_queue_init();
    m_next_app_instance = 0;
    m_next_page_addr = PSTORAGE_DATA_START_ADDR;
    m_module_initialized = true;

    for(unsigned int index = 0; index < PSTORAGE_MAX_APPLICATIONS; index++)
    {
        m_app_table[index].cb = NULL;
        m_app_table[index].block_size = 0;
        m_app_table[index].no_of_pages = 0;
        m_app_table[index].block_count = 0;
    }

